app/views/quality_specifications/index.html.erb

  <tr>
    <td><%= TestCode.find(quality_specification.test_code_id).testExpansion %></td>
---
SELECT "test_codes".* FROM "test_codes" WHERE "test_codes"."id" = $1 LIMIT 1  [["id", 355]]