app/controllers/change_loggings_controller.rb

  def index
    @change_loggings = ChangeLogging.order("created_at DESC")
---
SELECT `change_loggings`.* FROM `change_loggings` ORDER BY created_at DESC

  def show
    @change_logging = ChangeLogging.find(params[:id])
---
SELECT `change_loggings`.* FROM `change_loggings` WHERE `change_loggings`.`id` = 1 LIMIT 1

  def create
    @change_logging = ChangeLogging.new(params[:change_logging], :user_id => current_user.id, :user_email => current_user.email)

    respond_to do |format|
      if @change_logging.save
---
INSERT INTO `change_loggings` (`created_at`, `logRecord`, `updated_at`) VALUES ('2013-09-29 20:39:55', 'test', '2013-09-29 20:39:55')

  def deleteall

    ChangeLogging.delete_all
    changeLogging = ChangeLogging.new(:logRecord => 'Log cleared', :user_email => current_user.email)
    changeLogging.save
---
DELETE FROM `change_loggings`
INSERT INTO `change_loggings` (`created_at`, `logRecord`, `updated_at`, `user_email`) VALUES ('2013-09-29 20:54:02', 'Log cleared', '2013-09-29 20:54:02', 'craig.webster@mac.com')