app/controllers/quality_specifications_controller.rb

SELECT `quality_specifications`.* FROM `quality_specifications`
---
  def index
    @quality_specifications = QualitySpecification.all

SELECT `quality_specifications`.* FROM `quality_specifications` WHERE `quality_specifications`.`id` = 2 LIMIT 1
---
  def show
    @quality_specification = QualitySpecification.find(params[:id])

SELECT `quality_specifications`.* FROM `quality_specifications` WHERE `quality_specifications`.`id` = 1 LIMIT 1
---
  def edit
    @quality_specification = QualitySpecification.find(params[:id])