app/controllers/test_codes_controller.rb

SELECT `test_codes`.* FROM `test_codes` ORDER BY `test_codes`.`id` ASC LIMIT 1
---
  def index
    @test_codes = TestCode.all

SELECT `test_codes`.* FROM `test_codes` WHERE `test_codes`.`id` = 1 LIMIT 1
---
  def edit
    @test_code = TestCode.find(params[:id])

SELECT `test_codes`.* FROM `test_codes` WHERE `test_codes`.`id` = 1 LIMIT 1
---
  def update
    @test_code = TestCode.find(params[:id])